Revit 2026 API

# CategoriesNewSubcategory Method

---

Add a new subcategory into the Autodesk Revit document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Category NewSubcategory(
	Category parentCategory,
	string name
)
```
```vb
Public Function NewSubcategory (
	parentCategory As Category,
	name As String
) As Category
```
```cpp
public:
Category^ NewSubcategory(
	Category^ parentCategory,
	String^ name
)
```
```fsharp
member NewSubcategory :
        parentCategory : Category *
        name : string -> Category
```

#### Parameters

parentCategory Category
     The parent category.
name String
     The new category name.

#### Return Value

CategoryIf successful, the newly created subcategory.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"parentCategory" or "name"-is . |
| ArgumentException | Thrown when the input argument-"parentCategory"-cannot add subcategory. Thrown when the input argument-"name"-is an illegal name. |
| InvalidOperationException | Thrown when subcategory creation failed. |

#### Reference

Categories Class

Autodesk.Revit.DB Namespace